# -- coding: utf-8 ---
'''
    列表元素访问和计数

    1、index() 获取指定元素在列表中首次出现的位置
    2、count() 在列表中出现的次数
    3、 成员资格的判断,就是判断元素是否在列表里面 in 或者 not in

    切片操作
    arr[start开始位置: end结束位置: step步长]
        start 默认的是0
        end 默认的是 len - 1
        step 默认的是 1

    a[:] 从头到尾拷贝一遍
    a[2:] 从下标2开始到结束
    a[:3] 从0 到 3
    a[0:6:2] 从0 到 6 步长是2

    还可以是负数

'''

# a = [10, 20, 30, 40, 10, 20]
# b = a.index(30)
# print(b)
#
# d = a.count(10)
# print(d)
#
# c = 10 in a
# print(c)
a = [10, 20, 30, 40, 50, 60, 70, 80, 90]
# b = a[:]
# b = a[2:]
# b = a[:3]
# b = a[0:6:2]

# b = a[-2::]
# b = a[-5:-1:]
b = a[::-1]

print(b)
